---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetVisibility
source: html/61c9a859-14a2-1e9e-455c-efa77220a149.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetVisibility Method

Gets the visibility for the point.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the
ReferencePoint.